[
  {
    "title": "AI Engineer ",
    "company": "6sense",
    "description_text": "By leveraging advanced statistical methods, machine learning, and programming, the AI Engineer is responsible for designing and implementing complex AI solutions. Additionally, the AI Engineer ensures efficient workflows, automates processes, and effectively communicates insights to stakeholders, aiming to enhance productivity, strategic decision-making, and overall business success. Develop detailed AI solution requirements and effectively manage the development process, adapting to changing circumstances and requirements. Develop models that inform strategic decision-making at the highest organizational levels, leveraging advanced machine learning techniques. Performance Measurement AI Solution Effectiveness: Measure the effectiveness of AI solutions developed by assessing their impact on solving complex business problems. Strong communication skills to convey complex insights to stakeholders and effective leadership in managing data science teams. Ability to align data science goals with broader business objectives, leveraging insights for strategic decision-making. Ability to adapt to changing requirements and circumstances, ensuring the successful delivery of AI solutions in dynamic environments. We’ll make sure you have the equipment and support you need to work and connect with your teams, at home or in one of our oﬃces. We have a growth mindset culture that is represented in all that we do, from onboarding through to numerous learning and development initiatives including access to our LinkedIn Learning platform.",
    "url": "https://www.linkedin.com/jobs/view/4197395220/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=U%2B5ijaSwQDilfW%2FhTz8BjA%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "Backend Engineer, Core Technology ",
    "company": "Stripe",
    "description_text": "About the job Who we are About Stripe Stripe is a financial infrastructure platform for businesses. About The Organization Stripe Infrastructure is responsible for the reliability, scale, performance, and cost of Stripe’s systems and the productivity and sentiment of Stripe’s people. You may work on a wide variety of critical business areas including: Core Infrastructure - We’re the home for Stripe's critical tier0 infrastructure systems (Compute, Networking, DocumentDB, Distributed Caching and High assurance engineering). We build the foundational platform for Stripe products and services to allow them to operate at scale. The systems we own support all of the data serving needs of high scale services and thousands of individual Stripes across the company. Application & Revenue Platform - We are responsible for the systems that allow automated billing of Stripe's users, and for building data platforms and pipelines needed for Stripe’s regulatory reports across global markets. If you meet these requirements, you are encouraged to apply. Ability to write high quality code (in programming languages like Go, Java, C/C++ etc) 2-12+ years of professional hands-on software development experience, able to write well-factored algorithms and have experience with commonly used data structure and algorithms Hands-on experience contributing to or building large scale distributed systems Strong collaboration skills, can work across workstreams within your team and contribute to your peers’ success Customer obsession, ability to articulate and represent customer experience in various forums to drive the right outcome Have the ability to thrive on a high level of autonomy, responsibility, and think of yourself as entrepreneurial Preferred Qualifications Experience optimizing the end to end performance of distributed systems Focuses on the needs of our users, both internal and external Holds yourself and others to a high bar when working with production Hybrid work at Stripe This role is available either in an office or a remote location (typically, 35+ miles or 56+ km from a Stripe office). This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process.",
    "url": "https://www.linkedin.com/jobs/view/4190700867/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=WdXQmSYCQS%2B7jGRYafGW2A%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "AI Product Engineer ",
    "company": "Ramp",
    "description_text": "We believe AI isn’t just the next big wave. It’s the new foundation for how business gets done. We’re investing in that future — and in the people bold enough to build it. Ramp is a financial operations platform designed to save companies time and money. Startups for more than 3 years, as well as the Forbes Cloud 100 Disruptor 50 , and TIME Magazine’s 100 Most Influential Companies . About The Role We are fundamentally an engineering-driven company, and as we enter our next chapter, we're investing deeply in AI-native products to reshape how software empowers businesses. This role is ideal for a builder who thrives at the intersection of AI capabilities and product experience — someone excited to craft intelligent, user-facing features from the ground up and push the boundaries of what’s possible with LLMs and agentic workflows. What You’ll Do Architect and ship new AI-native product experiences across Ramp, from 0→1 prototypes to scaled production systems Build LLM-powered agents that autonomously reason through complex workflows Contribute to our evolving AI product stack: prompt orchestration, context engineering, evals, embeddings, and retrieval systems Develop full-stack product surfaces (backend & frontend) that incorporate AI into user experiences Collaborate closely with AI platform, infra, and design to push the capabilities of our internal and external tooling Stay on the bleeding edge of the AI ecosystem (tools like Claude Code, Cursor, OpenAI Agent SDK, MCPs, etc.) and identify where and how we can adopt emerging techniques Influence Ramp’s broader AI product strategy and technical vision What You'll Need 2+ years of software engineering experience, including time spent building production-grade full-stack systems Demonstrated experience building AI-powered product features Fluency with modern LLM platforms and AI-assisted engineering tools (e.g., Cursor, Claude Code), with a bias toward rapid experimentation and a working knowledge of prompt engineering, retrieval, and orchestration Strong backend fundamentals (Python, Postgres, etc.)",
    "url": "https://www.linkedin.com/jobs/view/4281930421/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=QAkLssvvSoGd8SZWq3Nd6w%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "Applied AI Engineer ",
    "company": "Komodo Health",
    "description_text": "About the job We Breathe Life Into Data At Komodo Health, our mission is to reduce the global burden of disease. The Opportunity At Komodo Health Komodo Health is transforming healthcare by building the leading healthcare analytics platform. Our AI team, Labs@Komodo, is pioneering this transformation by delivering AI-native solutions that elevate both the products we bring to market and the way we build them. We’re looking for engineers who approach AI like product managers—owning the full lifecycle of intelligent systems: from rapid prototyping to feedback-driven iteration to scalable deployment, with a deep focus on how these systems deliver value, evolve over time, and integrate across the broader product ecosystem. Mentored others in using AI to solve real problems by sharing best practices in prompt design, agent orchestration, and rapid iteration. Expectations Of AI Use In This Role (required) This role is AI-native by design—you are expected to apply GenAI, agent-based workflows, and cutting-edge models as your default problem-solving toolkit. and internal agents. This role may also be eligible for equity awards. In addition, this role is eligible for benefits including, but not limited to, comprehensive health, dental, and vision insurance; flexible time off and holidays; 401(k) with company match; disability insurance and life insurance; and leaves of absence in accordance with applicable state and local laws and regulations and company policy. What We Offer Positions may be eligible for company benefits in accordance with Company policy.",
    "url": "https://www.linkedin.com/jobs/view/4265241475/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=5zc%2BQockT2qeEaM%2BRH5vVg%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "Developer Experience Engineer - AI Compiler ",
    "company": "Tenstorrent",
    "description_text": "Our diverse team of technologists have developed a high performance RISC-V CPU from scratch, and share a passion for AI and a deep desire to build the best AI platform possible. We are seeking a Developer Experience Engineer to improve the way engineers build, test, and release software across our AI platform. In this role, you will work across teams to enhance internal tooling, improve code quality, and drive reliability throughout the development lifecycle. We welcome candidates at various experience levels for this role. Experienced with CI/CD systems, test automation, and release workflows. Familiar with tools like linters, static analyzers, and code review automation. What You Will Learn How to scale developer infrastructure and quality assurance across a full stack AI platform. This offer of employment is contingent upon the applicant being eligible to access U.S. export-controlled technology. Export Administration Regulations (EAR), the Company is required to ensure compliance with these laws when transferring technology to nationals of certain countries (such as EAR Country Groups D:1, E1, and E2). These requirements apply to persons located in the U.S. and all countries outside the U.S. As the position offered will have direct and/or indirect access to information, systems, or technologies subject to these laws, the offer may be contingent upon your citizenship/permanent residency status or ability to obtain prior license approval from the U.S. Commerce Department or applicable federal agency.",
    "url": "https://www.linkedin.com/jobs/view/4281389200/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=veiv8I1gSTOpMWkqR8kz2g%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "Quantitative Software Engineer: Techniques Engineering ",
    "company": "Two Sigma",
    "description_text": "About the job Position Summary Two Sigma is a financial sciences company, combining data analysis, invention, and rigorous inquiry to help solve the toughest challenges in investment management, securities, private equity, and venture capital. Our team of scientists, technologists, and academics looks beyond the traditional to develop creative solutions to some of the world’s most complex economic problems. We’re seeking an experienced Machine Learning/AI Engineer who is passionate about bridging innovative research with production-level deployment. You Will Take On The Following Responsibilities Collaborate with ML researchers to explore model architectures, training methodologies, and experimental objectives Translate prototypes into reusable, maintainable, and production-ready code, ensuring research insights scale seamlessly into operation Design, implement, and optimize fully automated training pipelines and evaluation workflows Optimize models for production—improving efficiency through techniques like quantization, distillation, and intelligent batching Continuously assess and fine-tune both research and production workflows, integrating user feedback and automated monitoring systems Identify and implement opportunities for process improvements to reduce bottlenecks and improve overall modeler efficiency. Stay ahead of industry trends and new technologies, incorporating sophisticated methodologies into production systems Provide technical guidance and mentorship to peers, ensuring the team uses new tools and techniques that drive innovation You Should Possess The Following Qualifications BS in Computer Science, Mathematics, Physics, or related technical subject area Minimum 1 year of experience required; 7-15 years of experience preferred Strong software engineering skills using Python, version control, testing frameworks, and CI/CD practices Ability to work across functions and influence technical strategy while balancing research innovation with operational excellence A phenomenal teammate that can work efficiently with modeling and engineering partners Experience with leading ML frameworks (e.g., PyTorch, TensorFlow, HuggingFace) and familiarity with model serving/deployment tools, distributed systems and data infrastructures Experience with the following are preferred but not required: Working with LLMs, multimodal models, or time-series forecasting ML Ops platforms Background in research or a proven understanding of ML theory You Will Enjoy The Following Benefits Core Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance Perks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms Learning: Tuition reimbursement, conference and training sponsorship Time Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves Hybrid Work Policy: Flexible in-office days with budget for home office setup The base pay for this role will be between $165,000 and $300,000. This role may also be eligible for other forms of compensation and benefits, such as a discretionary bonus, health, dental and other wellness plans and 401(k) contributions. Discretionary bonus can be a significant portion of total compensation. We are proud to be an equal opportunity workplace. Two Sigma is committed to providing reasonable accommodations to qualified individuals in accordance with applicable federal, state, and local laws. If you believe you need an accommodation, please visit our website for additional information.",
    "url": "https://www.linkedin.com/jobs/view/4210015264/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=vGPuDWe2QW6otiKxX4QZ9g%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "title": "Developer Experience Engineer - AI Compiler ",
    "company": "Tenstorrent",
    "description_text": "Our diverse team of technologists have developed a high performance RISC-V CPU from scratch, and share a passion for AI and a deep desire to build the best AI platform possible. We are seeking a Developer Experience Engineer to improve the way engineers build, test, and release software across our AI platform. In this role, you will work across teams to enhance internal tooling, improve code quality, and drive reliability throughout the development lifecycle. We welcome candidates at various experience levels for this role. Experienced with CI/CD systems, test automation, and release workflows. Familiar with tools like linters, static analyzers, and code review automation. What You Will Learn How to scale developer infrastructure and quality assurance across a full stack AI platform. This offer of employment is contingent upon the applicant being eligible to access U.S. export-controlled technology. Export Administration Regulations (EAR), the Company is required to ensure compliance with these laws when transferring technology to nationals of certain countries (such as EAR Country Groups D:1, E1, and E2). These requirements apply to persons located in the U.S. and all countries outside the U.S. As the position offered will have direct and/or indirect access to information, systems, or technologies subject to these laws, the offer may be contingent upon your citizenship/permanent residency status or ability to obtain prior license approval from the U.S. Commerce Department or applicable federal agency.",
    "url": "https://www.linkedin.com/jobs/view/4280359243/?refId=efed7a16-f1b4-40c2-9add-cbabe9e2e4d9&trackingId=MfQqpoDARi%2Bn1T5RQJ59qA%3D%3D&trk=flagship3_job_home_savedjobs"
  }
]