[
  {
    "description_text": "About the job\nAt Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nCadence is the leader in hardware emulation-prototyping technology and products. System engineering team is responsible to define, validate and enable the products. We are now looking for a hands-on system integration engineer who wants to expand his/her scope, work with the interactions of a complex multi-rack system and grow his/her career.\nThis position is a highly visible function to bridge and gate-keep the full integration, validation, and characterization of ASIC, HW/PCB, SW, FW, and FPGA subsystems in the whole development cycle. The same discipline also applies to system bring-up and testing, methodology development and verification.\nKey Responsibilities\nLeverage silicon verification platform and environment to create necessary post-silicon infrastructure, methodology and automation to allow tests executed in a timely and efficient manner.\nIntegrate silicon, HW, firmware, and system software into a complete system which includes various InfiniBand and PCIe protocols, PXE booting, virtual machines, secure networks, Ethernet and Ethernet-over-Infiniband, sockets and RPC calls, FPGA, microcontroller interfaces, JTAG, I2C, SPI, SERDES, memory and many other interfaces.\nExecute post-silicon tests to expose design issues, validate product against the specifications including performance, and qualify the design for production release.\nReview, replicate, and respond to customer issues. Perform initial analysis of error logs from customer design simulation runs. Debug and isolate system-level issues down to ASIC/FPGAs, host servers, subsystems, firmware modules, runtime diagnostics.\nDevelop silicon and system stress tests. Leverage tests developed by other engineers. Package tests for production and field use.\nDefine, develop and drive the implementation of validation automation environment.\nPosition Requirements\nBS in Electrical Engineering, Computer Engineering or Computer Science\nFluent in at least one functional scripting language, preferably but not limited to Python. Other languages are plus.\nExperience with embedded software/firmware, operating systems, and/or HW/SW interfaces is a plus\nExperience in developing, maintaining and operating automated engineering processes is a big plus.\nStrong interpersonal and communication skills, self-motivated and ability to work with cross-functions teams around the globe.\nThe annual salary range for California is $88,900 to $165,100. You may also be eligible to receive incentive compensation: bonus, equity, and benefits. Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. Please note that the salary range is a guideline and compensation may vary based on factors such as qualifications, skill level, competencies and work location. Our benefits programs include: paid vacation and paid holidays, 401(k) plan with employer match, employee stock purchase plan, a variety of medical, dental and vision plan options, and more.\nWe’re doing work that matters. Help us solve what others can’t.\n… more\nBenefits found in job post\n401(k)",
    "url": "https://www.linkedin.com/jobs/view/4301906897/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=agxvCRzsTb62WUjEQl0wcA%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nApplication Close Date\nApplications will be accepted on an ongoing basis until the requisition is closed.\nAt Blue Origin, we envision millions of people living and working in space for the benefit of Earth. We’re working to develop reusable, safe, and low-cost space vehicles and systems within a culture of safety, collaboration, and inclusion. Join our team of problem solvers as we add new chapters to the history of spaceflight!\nWe are collaborators, doers, and problem-solvers who are relentlessly committed to a culture of safety. This position will directly impact the history of space exploration and will require your commitment and detailed attention towards safe and repeatable space flight. Join us in lowering the cost of access to space and enabling Blue Origin’s vision of millions of people living and working in space to benefit Earth.\nEarly Career Pathways:\nWe offer two pathways for full-time employment (please indicate your preference in your application):\nDirect Hire: Multiple positions available across our Business Units. You will be matched with an appropriate engineering team based on your skillset and experience and our current business needs.\nNew Graduate Rotation Program: This one-year development program enables you to expand your engineering skillset through a variety of hands-on experience and mentorship. Throughout your three four-month rotations, you'll explore a variety of fields supporting our business units: New Shepard, New Glenn, Blue Engines, Lunar Permanence, In-Space Systems, Advanced Concepts and Enterprise Engineering, and Operations. Upon completing this uniquely personalized program, you'll collaborate with the Program Manager to determine the best team fit for your ongoing career.\nTimeline:\nApplications will be reviewed on a rolling basis staring in early September. Due to the high volume of applications, please expect to hear back from us approximately one month after applying.\nPrimary locations:\nWe prioritize placing early career engineers in locations where they can be co-located with their team and the relevant hardware they support. The primary locations for this role are listed below. Please indicate in the application where you would be willing to be located.\nKent, WA\nLos Angeles, CA\nResponsibilities include but are not limited to:\nYour projects may include designing, building, and maintaining software applications and their components.\nBased upon your placement, your work may involve many aspects of applied software development, requirement analysis, code development, testing, collaboration, documentation and system integration.\nCollaborate with multidisciplinary teams to build verification plans, frameworks, tools, and tests for safety critical, real-time, embedded software that support control and diagnostics of human capable spacecraft, for both orbital and sub-orbital programs.\nReview and update software requirements and designs for verifiability.\nWrite code to verify software for various embedded environments in C, C++, and Python.\nDesign adversarial, requirements based, automated tests.\nDevelop tools and infrastructure to support efficient build, debugging, and deployment.\nQualifications\nMinimum of a BS Degree in computer engineering, computer science, electrical engineering, mathematics, physics, aerospace, or related field.\nWill have earned their degree within the last year and able to start by Fall 2026.\nExperience with:\nSoftware development skills, particularly in C/C++, Python, or C#/Java.\nProblem solving and debugging skills, particularly in C/C++.\nExperience with formalized verification activities (Test cases, procedures, reports).\nCollaborative interactions with software development teams while maintaining objectivity and independence.\nRelevant internship/co-op and/or hands-on experience that demonstrate development of both technical skills as well as leadership qualities.\nAbility to earn trust, maintain positive and professional relationships, and strengthen our culture of inclusion.\nAbility to work independently and as part of a team on rapid development programs.\nFlexible and adaptable mindset.\nSelf-driven with the ability to seek out requirements with minimal direction.\nDesired\nAdvanced degree in Computer Science or Software Engineering.\nExperience with:\nExperience with build, and test, and deployment automation.\nExperience with and understanding of computer networking systems and protocols.\nExperience with distributed applications and safety-critical software development.\nExperience with Qt framework/QML.\nExperience with DevOps and Agile / Scrum.\nWorking knowledge of configuration management and source code management systems.\nHow To Prepare\nWe are solving challenging, new problems and we need people to represent a wide variety of perspectives. Experience in aerospace is not a requirement. We value broad academic and industry experiences such as Tech, Oil & Gas, Nuclear, Automotive, and more.\nWhen you apply, include your internship, co-curricular and research experience in your resume. Please also include the relevant programming languages you have used in these settings. If you haven’t yet used a tool in a professional setting, please include relevant coursework that demonstrates your preparation for these roles.\nCompensation Range For\nCA applicants is $99,445.00-$139,222.65;WA applicants is $99,445.00-$139,222.65\nOther Site Ranges May Differ\nCulture Statement\nDon’t meet all desired requirements? Studies have shown that some people are less likely to apply to jobs unless they meet every single desired qualification. At Blue Origin, we are dedicated to building an authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every desired qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.\nExport Control Regulations\nApplicants for employment at Blue Origin must be a U.S. citizen or national, U.S. permanent resident (i.e. current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\nBackground Check\nRequired for all positions: Blue’s Standard Background Check\nRequired for Certain Job Profiles: Defense Biometric Identification System (DBIDS) background check if at any time the role requires one to be on a military installation\nRequired for Certain Job Profiles: Drivers who operate Commercial Motor Vehicles with a Gross Vehicle Weight (GVW), Gross Vehicle Weight Rating (GVWR) or combination of power unit and trailer that meets or exceeds 10,001 lbs. and/or transports placardable amounts of hazardous materials by ground in any vehicle on a public road while in commerce, may be subject to additional Federal Motor Carrier Safety Regulations including: Driver Qualification Files, Medical Certification (obtained before onboarding), Road Test, Hours of Service, Drug and Alcohol Testing (CDL drivers only), vehicle inspection requirements, CDL requirements (if applicable) and hazardous materials transportation/shipping training.\nRequired for certain Job Profiles: Ability to obtain and maintain Merchant Mariner Credential, which includes pre-employment and random drug testing as well as DOT physical\nBenefits\nBenefits include: Medical, dental, vision, basic and supplemental life insurance, paid parental leave, short and long-term disability, 401(k) with a company match of up to 5%, and an Education Support Program.\nPaid Time Off: Up to four (4) weeks per year based on weekly scheduled hours, and up to 14 company-paid holidays.\nDiscretionary bonus: Bonuses are designed to reward individual contributions as well as allow employees to share in company results.\nEligibility for benefits varies by role type, please check with your recruiter for a comprehensive list of the benefits available for this role.\nEqual Employment Opportunity\nBlue Origin is proud to be an Equal Opportunity/Affirmative Action Employer and is committed to attracting, retaining, and developing a highly qualified and dedicated work force. Blue Origin hires and promotes people on the basis of their qualifications, performance, and abilities. We support the establishment and maintenance of a workplace that fosters trust, equality, and teamwork. We provide all qualified applicants for employment and employees with equal opportunities for hire, promotion, and other terms and conditions of employment, regardless of their race, color, religion, sex, sexual orientation, gender identity, national origin/ethnicity, age, physical or mental disability, genetic factors, military/veteran status, or any other status or characteristic protected by federal, state, and/or local law. Blue Origin will consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state, and local laws, including the Washington Fair Chance Act, the California Fair Chance Act, the Los Angeles Fair Chance in Hiring Ordinance, and other applicable laws. For more information on “Know Your Rights,” please see\nhere\n.\nAffirmative Action and Disability Accommodation\nApplicants wishing to receive information on Blue Origin’s Affirmative Action Plans, or applicants requiring a reasonable accommodation in order to participate in the application and/or interview process, please contact us at EEOCompliance@blueorigin.com. Please note this is a publicly managed inbox. Please do not include any personal medical information in your request.\nCalifornia Applicant Privacy Notice\nIf you are a California resident, please reference the CA Applicant Privacy Notice\nhere\n.\n… more\nBenefits found in job post\n401(k)",
    "url": "https://www.linkedin.com/jobs/view/4292765984/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=CBCtGnwwQR6ZRllGBFktZg%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nAnduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nABOUT THE TEAM\nThe Air Defense team builds robots that find other robots and knock them out of the sky. At a time when air superiority can no longer be taken for granted, the Air Defense Team provides mission critical capabilities to warfighters. From detection to tracking, identification, deterrence, and defeat, our family of networked sensors and effectors enables our customers to rapidly close the kill chain against a broad range of Unmanned Aerial System (UAS) threats. Working across product, engineering, sales, logistics, operations, and mission success, the Air Defense team develops, tests, deploys, and sustains the Anduril Air Defense Family of Systems (FoS) in challenging operational environments worldwide.\nABOUT THE JOB\nAs a Mission Software Engineer, you will solve a wide variety of problems involving networking, autonomy, systems integration, robotics, and more, while making pragmatic engineering tradeoffs along the way. Your efforts will ensure that Anduril products seamlessly work together to achieve a variety of critical outcomes. Above all, Mission Software Engineers are driven by a “Whatever It Takes” mindset—executing in an\nexpedient\n,\nscalable\n, and\npragmatic\nway while keeping the mission top-of-mind and making sound engineering decisions to deliver successful outcomes correctly, on-time, and with high quality.\nWHAT YOU’LL DO\nOwn the software solutions that are deployed to customers\nWrite code to improve products and scale the mission capability to more customers\nCollaborate across multiple teams to plan, build, and test complex functionality\nCreate and analyze metrics that are leveraged for debugging and monitoring\nTriage issues, root cause failures, and coordinate next steps\nPartner with end-users to turn needs into features while balancing user experience with engineering constraints\nTravel up to 30% of time to build, test, and deploy capabilities in the real world\nREQUIRED QUALIFICATIONS\nStrong engineering background from industry or school, ideally in areas/fields such as Computer Science, Software Engineering, Mathematics, or Physics\n3+ years working with a variety of programming languages such as Python, C++, Rust, Go, JavaScript, etc.\nStrong Experience with React and Javascript/TypeScript\nExperience building software solutions involving significant amounts of data processing and analysis\nAbility to quickly understand and navigate complex systems and established code bases\nA desire to work on critical software that has a real-world impact\nEligible to obtain and maintain an active U.S. Secret security clearance\nPREFERRED REQUIREMENTS\nStrong background with focus in Physics, Mathematics, and/or Motion Planning to inform modeling & simulation (M&S) and physical systems\nDeveloping and testing multi-agent autonomous systems and deploying in real-world environments\nFeature and algorithm development with an understanding of behavior trees\nDeveloping software/hardware for flight systems and safety critical functionality\nDistributed communication networks and message standards\nKnowledge of military systems and operational tactics\nWHAT WE VALUE IN MISSION SOFTWARE\nCustomer Facing\n- Mission Software Engineers are the software engineers closest to Anduril customers, end-users, and the technical challenges of operational scenarios.\nMission First\n- Above all, MSEs execute their mission in an\nexpedient\n,\nscalable\n, and\npragmatic\nway. They keep the mission top-of-mind and make pragmatic and thoughtful engineering decisions to deliver successful outcomes.\nSmall Project Wrangling = Large Project Impact\n- Our MSEs are the voice of our business line(s). They are the forcing function that gets us to think about how a project will transition to production and tie in to the centralized functions across the business.\nEmbrace Challenge (and follow through)\n- We take responsibility for achieving the mission; Developing technical self-sufficiency across a wide range of environments. Ruthlessly prioritizing, while honing our ability to understand large systems and incorporate new components in varying levels of complexity.\nUS Salary Range\n$166,000 - $220,000 USD\n… more\nFeatured benefits\nMedical insurance, Vision insurance, Dental insurance, 401(k), Paid maternity leave, Paid paternity leave, Commuter benefits",
    "url": "https://www.linkedin.com/jobs/view/4286562248/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=aupahYpSSsW5uD72q9d1kw%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nAnduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nAbout The Team\nAnduril's Space team is dedicated to expanding our AI-powered capabilities into the final frontier, enhancing Space Domain Awareness, Space Control, and Command and Control for U.S. military and allied partners. We're developing fully integrated hardware and software systems, including Lattice for Space Missions and modular payloads, to address growing threats in space and ensure our Guardians maintain a decisive advantage in this contested warfighting domain.\nAbout The Job\nAs an Orbital Software Engineer on Space, you will contribute to the architecture and deployment of software solutions that support specific customer missions for on-orbit spacecraft operations and mission management. As a software engineer, you will provide guidance and oversight to a team developing modular capabilities to support the DoD and IC customers across the space domain. This will involve architecture of an orbital software system in coordination with the Anduril Lattice software platform team, algorithms, techniques and coding development to support orbital systems and their interfacing with multi-domain systems. The Anduril orbital software capability development will ensure integration with legacy systems that have been part of our nation’s critical defense for decades as well as new space systems being added to the cache of orbital and ground-based capabilities. The role will also be responsible for the interfaces to multi-modal payload platforms, bus platforms and networking solutions in proliferated satellite constellations\nWe work with mission partners and operators to deploy reliable and robust capabilities on operationally-relevant fielding timelines to meet complex challenges across the DOD and IC.\nWhat You’ll Do\nContribute to software solutions that are deployed to customers.\nContribute to development of on-orbit software capabilities to enable delivery of end-to-end mission systems.\nIntegrate with legacy systems to unlock 21st-century capabilities.\nWrite code to improve products and scale the mission capability to different users and customers.\nCollaborate across multiple teams to plan, build, and test complex functionality.\nCreate and analyze metrics that are leveraged for debugging and monitoring.\nTriage issues, root cause failures, and coordinate next-steps.\nPartner with end-users to turn needs into features while balancing user experience with engineering constraints.\nRequired Qualifications\nStrong engineering background from industry or school, ideally in areas/fields such as Computer Science, Software Engineering, Mathematics, or Physics.\nAbility to quickly understand and navigate complex systems and detailed requirements.\nCapable of solving complex technical problems with little oversight.\nClear communication and organizational skills including documentation and training material.\nProfessional experience working with a variety of programming languages such as Python, C++, Rust, or Go\nExperience with spacecraft software systems and spacecraft operations.\nExperience with satellite mission autonomy to include fault isolation and recovery systems.\nEligible to obtain and maintain an active U.S. Secret security clearance.\nPreferred Qualifications\nAdvanced expertise with Python, Go, Rust, or C++.\nExperience with deployment tooling like Kubernetes, OpenShift, or Helm.\nA desire to work on critical software in the space domain.\nExperience with OMS/UCI standards and modular software services development.\nUS Salary Range\n$166,000—$220,000 USD\nHealthcare Benefits\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nUS Roles: Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles: We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles: We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection: Anduril covers life and disability insurance for all employees.\nGenerous time off: Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support: Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources: Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development: Annual reimbursement for professional development\nCommuter Benefits: Company-funded commuter benefits based on your region.\nRelocation Assistance: Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles: Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles: Pension plan with employer match.\nAUS Roles: Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit\nhttps://anduril.com/applicant-privacy-notice/\n.\n… more\nBenefits found in job post\nMedical insurance, Disability insurance, Commuter benefits, Pension plan",
    "url": "https://www.linkedin.com/jobs/view/4300138482/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=TiyYFeCkTfCWNOoiahuogQ%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nAnduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\nAbout The Job\nWe are looking for Software Engineers to join our rapidly growing team! We have positions open in Costa Mesa, CA. These roles are targeted to start on a quarterly basis beginning in 2026. We hire self-motivated people, those who hold a higher bar for themselves than anyone else could hold for them. If you are eager to solve tough problems, then this role might be for you!\nWhat You’ll Do\nSupport the software solutions that are deployed to customers and key stakeholders.\nWrite code to improve products and scale the mission capability to more customers.\nCollaborate across multiple teams to plan, build, and test complex functionality.\nCreate and analyze metrics that are leveraged for debugging and monitoring.\nTriage issues, root cause failures, and coordinate next-steps.\nWork on real, meaningful projects and learn from experienced professionals along the way.\nRequired Qualifications\nMust be pursuing or have completed a Bachelor’s or Master’s degree in Computer Science, Computer/Software Engineering, Mathematics, Physics, or a related field.\n3 months - 2 years of technical work to include technical internship and able to start full time in 2026.\nFamiliarity with algorithms, data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.\nProficiency in a variety of programming languages such as C++, Go, Rust, Java, and Python.\nA desire to work on software and applications that have real-world impact.\nMust be a U.S. Person due to required access to U.S. export controlled information or facilities; U.S. clearance eligibility may be required depending on program.\nPreferred Qualifications\nHave a bias for action. If you see a problem, you want to solve and fix it.\nBe naturally curious about the technologies and tools you use.\nLow-ego, high ownership, and mission oriented.\nAnduril is an equal-opportunity employer, and we encourage candidates from all backgrounds to apply. If you are someone passionate to work on problems that matter, we’d love to hear from you!\nUS Salary Range\n$130,000—$135,000 USD\nHealthcare Benefits\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including:\nUS Roles: Comprehensive medical, dental, and vision plans at little to no cost to you.\nUK & AUS Roles: We cover full cost of medical insurance premiums for you and your dependents.\nIE Roles: We offer an annual contribution toward your private health insurance for you and your dependents.\nAdditional Benefits\nIncome Protection: Anduril covers life and disability insurance for all employees.\nGenerous time off: Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs.\nFamily Planning & Parenting Support: Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting.\nMental Health Resources: Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available.\nProfessional Development: Annual reimbursement for professional development\nCommuter Benefits: Company-funded commuter benefits based on your region.\nRelocation Assistance: Available depending on role eligibility.\nRetirement Savings Plan\nUS Roles: Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles: Pension plan with employer match.\nAUS Roles: Superannuation plan.\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.\nTo view Anduril's candidate data privacy policy, please visit\nhttps://anduril.com/applicant-privacy-notice/\n.\n… more\nBenefits found in job post\nMedical insurance, Disability insurance, Commuter benefits, Pension plan",
    "url": "https://www.linkedin.com/jobs/view/4283472537/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=9Qo1AqJyRVKnCfiPfItTVw%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nWe believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.\nResponsibilities\nDesign & Development: Build and maintain backend services with a focus on performance, reliability and scalability.\nCollaboration: Work closely with product managers and other stakeholders to define and implement new features that meet product and customer needs.\nCode Quality: Write clean, maintainable and efficient code.\nTesting & Debugging: Develop automated tests to ensure the quality and reliability of the codebase. Troubleshoot and resolve issues.\nQualifications\n1-4 years as a backend engineer.\nWorking knowledge of one or more programming languages such as Go, Python, Java, or Node.js.\nExperience MySQL or other relational databases.\nExperience working with microservices.\nExcellent coding and testing skills.\nHigh ownership. You are excited to roll up your sleeves and figure things out that don’t have precedent at Plaid.\nCustomer empathy. You want to be face to face with customers (internal or external) to understand their needs and design products together.\n$148,800 - $223,200 a year\nThe target base salary for this position ranges from $148,800/year and $223,200/year in Zone 1. The target base salary will vary based on the job's location.\nOur Geographic Zones Are As Follows\nZone 1 - New York City and San Francisco Bay Area\nZone 2 - Los Angeles, Seattle, Washington D.C.\nZone 3 - Austin, Boston, Denver, Houston, Portland, Sacramento, San Diego\nZone 4 - Raleigh-Durham and all other US cities\nAdditional compensation in the form(s) of equity and/or commission are dependent on the position offered. Plaid provides a comprehensive benefit plan, including medical, dental, vision, and 401(k). Pay is based on factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience and skillset, and location. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\nOur mission at Plaid is to unlock financial freedom for everyone. To support that mission, we seek to build a diverse team of driven individuals who care deeply about making the financial ecosystem more equitable. We recognize that strong qualifications can come from both prior work experiences and lived experiences. We encourage you to apply to a role even if your experience doesn't fully match the job description. We are always looking for team members that will bring something unique to Plaid!\nPlaid is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate based on race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local laws. Plaid is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance with your application or interviews due to a disability, please let us know at [email protected] .\nPlease review our Candidate Privacy Notice here .\n… more\nBenefits found in job post\n401(k)",
    "url": "https://www.linkedin.com/jobs/view/4204412244/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=HJIQneejSDCDhzEKNvlYVA%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nAbout Neuralink:\nWe are creating devices that enable a bi-directional interface with the brain. These devices allow us to restore movement to the paralyzed, restore sight to the blind, and revolutionize how humans interact with their digital world.\nTeam Description:\nThe Next Gen team at Neuralink is developing the next generation of brain-computer interfaces. We are laying the groundwork for intuitive, high-dimensional, and bidirectional interfaces between brains and machines, with the goal of helping people challenged by a variety of neurological disorders and conditions. Our team consists of scientists and engineers, working closely together to define the engineering requirements for these future products.\nJob Description and Responsibilities:\nAs a Software Engineer, you will write, test and deploy software that interacts with our neural interfaces and other data acquisition systems to decode and modulate brain activity. We are looking for hands-on engineers who are excited to own the end-to-end engineering of next-generation software systems for the control of assistive robotic arms (CONVOY), visual prostheses (Blindsight), and medical imaging data pipelines. Successful candidates will be highly adaptable, able to deploy their core technical and creative skills to tackle a wide range of problems, and have a keen sense of urgency. The job responsibilities will include:\nDeveloping, validating, testing, and deploying software systems\nWriting algorithms to decode and modulate neural activity\nDesigning user experiences centered around neural control of devices\nMentoring others in achieving engineering excellence through code review, design review, and technical presentations\nPresenting results in a collaborative setting\nWorking with neuroengineers and animal training specialists to support research sessions\nRequired Qualifications:\nBachelor's degree in computer science, a related field, or equivalent work experience\nFluent in modern front-end and/or mobile development tools (Typescript, Swift) and a high-performance backend language (Python, Golang)\nHW/SW debugging skills with lab equipment\nA strong understanding of engineering first principles\nYou are mission-driven and goal-oriented in your approach to solving problems\nYou are resourceful, flexible, and adaptable; no task is too big or too small\nExcellent communication and collaboration skills\nPreferred Qualifications:\nHands-on experience writing software that interacts with robotics, control theory, human-robot interaction, or real-time systems\nWorking knowledge of compiled and system languages, ideally C/C++ or Rust\nExperience developing software for macOS or iOS, in Objective-C/Swift\nAbout You:\nYou find large challenges exciting and enjoy discovering and defining problems as much as solving them.\nYou deliver. You may enjoy thoughtful conversations about problems and perfecting designs, but in the end, you know that what matters is delivering reliable solutions.\nYou are a cross-disciplinary team member. You are excited to work with and learn from software, mechanical, electrical, materials, and neural engineers\nYou are comfortable communicating across teams\nYou feel a sense of urgency to get things done sooner rather than later\nResourceful, flexible and adaptable; no task is too big or too small\nYou are comfortable working closely with animals in a research environment\nExpected Compensation:\nThe anticipated base salary for this position is expected to be within the following range. Your actual base pay will be determined by your job-related skills, experience, and relevant education or training. We also believe in aligning our employees' success with the company's long-term growth. As such, in addition to base salary, Neuralink offers equity compensation (in the form of Restricted Stock Units (RSU)) for all full-time employees.\nBase Salary Range:\n$113,000—$188,000 USD\nWhat We Offer:\nFull-time employees are eligible for the following benefits listed below.\nAn opportunity to change the world and work with some of the smartest and most talented experts from different fields\nGrowth potential; we rapidly advance team members who have an outsized impact\nExcellent medical, dental, and vision insurance through a PPO plan\nPaid holidays\nCommuter benefits\nMeals provided\nEquity (RSUs) *Temporary Employees & Interns excluded\n401(k) plan *Interns initially excluded until they work 1,000 hours\nParental leave *Temporary Employees & Interns excluded\nFlexible time off *Temporary Employees & Interns excluded\n… more\nBenefits found in job post\nVision insurance, Commuter benefits",
    "url": "https://www.linkedin.com/jobs/view/4271380018/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=OcSm5K9WRE68MT90%2BpaY9A%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nMeta is seeking talented engineers to join our teams in building cutting-edge products that connect billions of people around the world. As a member of our team, you will have the opportunity to work on complex technical problems, build new features, and improve existing products across various platforms, including mobile devices and web applications. Our teams are constantly pushing the boundaries of user experience, and we're looking for passionate individuals who can help us advance the way people connect globally. If you're interested in joining a world-class team of industry veterans and working on exciting projects that have a significant impact, we encourage you to apply.\nSoftware Engineer, Machine Learning Responsibilities:\nCollaborate with cross-functional teams (product, design, operations, infrastructure) to build innovative application experiences\nImplement custom user interfaces using latest programming techniques and technologies\nDevelop reusable software components for interfacing with back-end platforms\nAnalyze and optimize code for quality, efficiency, and performance\nLead complex technical or product efforts and provide technical guidance to peers\nArchitect efficient and scalable systems that drive complex applications\nIdentify and resolve performance and scalability issues\nWork on a variety of coding languages and technologies\nEstablish ownership of components, features, or systems with expert end-to-end understanding\nMinimum Qualifications:\nCurrently has, or is in the process of obtaining a Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Degree must be completed prior to joining Meta\n2+ years of programming experience in a relevant language OR a PhD + 9 months programming experience in a relevant language\nTrack record of setting technical direction for a team, driving consensus and successful cross-functional partnerships\nExperience building maintainable and testable code bases, including API design and unit testing techniques\nPreferred Qualifications:\n2+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining, artificial intelligence, or a related technical field\nExperience with developing machine learning models at scale from inception to business impact\nExposure to architectural patterns of large scale software applications\nExperience with scripting languages such as PyTorch, TensorFlow, Python, JavaScript or Hack\nProven experience to translate insights into business recommendations\nExperience improving quality through thoughtful code reviews, appropriate testing, proper rollout, monitoring, and proactive changes\nKnowledge developing and debugging in C/C++ and Java, or experience with scripting languages such as Python, Perl, PHP, and/or shell scripts\nAbout Meta:\nMeta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\nMeta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.\nMeta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.\n$56.25/hour to $173,000/year + bonus + equity + benefits\nIndividual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about\nbenefits\nat Meta.\n… more",
    "url": "https://www.linkedin.com/jobs/view/4254373531/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=wZz9nvPaQDSdMgSHRjS1mQ%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nOur Mission:\n6sense is on a mission to revolutionize how B2B organizations create revenue by predicting customers most likely to buy and recommending the best course of action to engage anonymous buying teams. 6sense Revenue AI is the only sales and marketing platform to unlock the ability to create, manage and convert high-quality pipeline to revenue.\nOur People:\nPeople are the heart and soul of 6sense. We serve with passion and purpose. We live by our Being 6sense values of Accountability, Growth Mindset, Integrity, Fun and One Team. Every 6sensor plays a part in deﬁning the future of our industry-leading technology. 6sense is a place where difference-makers roll up their sleeves, take risks, act with integrity, and measure success by the value we create for our customers.\nWe want 6sense to be the best chapter of your career.\nPurpose of the Job\nAI Engineer leads and drives advanced AI initiatives within the organization. By leveraging advanced statistical methods, machine learning, and programming, the AI Engineer is responsible for designing and implementing complex AI solutions. This role involves innovatively solving business problems, optimizing algorithms, and deploying AI models to provide data-driven insights that align with the organization's strategic goals. Additionally, the AI Engineer ensures efficient workflows, automates processes, and effectively communicates insights to stakeholders, aiming to enhance productivity, strategic decision-making, and overall business success.\nJob Description\nResponsibilities & Accountabilities\nLead the design and development of complex AI solutions, employing advanced techniques to optimize algorithms and data sets for superior performance.\nDesign and implement experiments to rigorously evaluate AI solution performance and provide valuable insights for refinement.\nDevelop detailed AI solution requirements and effectively manage the development process, adapting to changing circumstances and requirements.\nCollaborate effectively with cross-functional teams and stakeholders, ensuring successful delivery while adapting to evolving needs and circumstances.\nStay updated with the latest trends and advancements in AI technology, incorporating newfound knowledge into solution design and development.\nApply mastery of statistical methods, machine learning algorithms, and programming languages to analyze unstructured data and derive actionable insights.\nDevelop novel modeling techniques and algorithms, utilizing advanced methodologies like Bayesian inference, reinforcement learning, and causal inference.\nCreate scalable models capable of handling large volumes of real -time data, ensuring transparency and explainability in the model's functioning.\nDevelop models that inform strategic decision-making at the highest organizational levels, leveraging advanced machine learning techniques.\nAlign business objectives with innovative data science solutions, proactively identifying opportunities for data-driven insights and product innovations.\nDevelop and implement advanced AI models, utilizing techniques like transfer learning, ensemble methods, and neural networks for complex problem -solving.\nDesign and implement efficient workflows, automate data -related tasks, and lead process improvement initiatives to enhance productivity and data accuracy.\nLead product development efforts, demonstrating an understanding of the business model and leveraging data for product decision-making and roadmap planning. Ethical Product Development: Understand and consider the ethical and legal implications of data-driven products and solutions, ensuring responsible and compliant development practices.\nPerformance Measurement\nAI Solution Effectiveness: Measure the effectiveness of AI solutions developed by assessing their impact on solving complex business problems.\nModel Performance and Optimization: Evaluate and optimize machine learning models to ensure they meet predefined performance metrics and business objectives.\nInnovative Solutions Impact: Assess the impact of innovative data science solutions on driving insights, product offerings, and business growth.\nEfficiency and Productivity: Evaluate the efficiency and productivity improvements achieved through process automation and optimization.\nStakeholder Communication: Assess the effectiveness of communication and collaboration with stakeholders in delivering successful AI solutions.\nAdaptability and Learning: Measure adaptability to changing requirements and the ability to quickly learn and apply new technologies and methodologies.\nProduct Alignment and User Impact: Evaluate the alignment of data -driven products with business goals and their impact on improving user experiences and satisfaction.\nEthical and Legal Compliance: Monitor compliance with ethical and legal standards in the development of data-driven products and solutions.\nEducational And Experience Requirements\nPh.D. or Master's in Computer Science, Data Science, or related field.\n5+ years in data science, machine learning, and AI, with progressive tech leadership roles.\nStrong Python, R, SQL, and advanced statistical and ML techniques.\nDesigning tailored ML models, optimizing algorithms, and AI solution deployment.\nDesigning efficient workflows, automation, and process improvements.\nExceptional communication and leadership skills, managing data science teams.\nDriving innovation, staying updated with emerging tech, and ensuring ethical compliance.\nEffective collaboration, adaptability to changing requirements and circumstances.\nCompetencies and Behaviors\nStrong advanced statistical methods, machine learning, and programming languages (Python, R, SQL).\nInnovative Problem-Solving: Proactive in identifying innovative data -driven insights, leveraging cutting-edge technologies, and challenging existing approaches.\nExpertise in designing and deploying complex AI solutions, optimizing algorithms, and integrating models effectively.\nProficient in automating workflows, improving processes, and enhancing efficiency in data collection, cleaning, analysis, and reporting.\nStrong communication skills to convey complex insights to stakeholders and effective leadership in managing data science teams.\nWillingness to stay updated with emerging trends, methodologies, and technologies, and adapt to changing requirements in the field.\nUnderstanding and adherence to ethical and legal implications related to data -driven products and solutions.\nEffective collaboration with cross-functional teams and stakeholders, ensuring successful project delivery through teamwork.\nDemonstrated contributions through research publications and thought leadership in the data science domain.\nAbility to align data science goals with broader business objectives, leveraging insights for strategic decision-making.\nUnderstanding and integrating user needs and experiences into product development, using data to drive user-centric decisions.\nAbility to adapt to changing requirements and circumstances, ensuring the successful delivery of AI solutions in dynamic environments.\nEfficiently manage time and prioritize tasks to meet project deadlines and organizational goals.\nCommitment to maintaining high-quality standards, adhering to compliance requirements, and ensuring data accuracy and validity.\nBase Salary Range: $133,687.50 - $178,250.00. The base salary range represents the anticipated low and high end of the base salary range for this position. Actual salaries may vary and may be above or below the range based on various factors, including but not limited to work location and experience. The base salary is one component of 6sense’s total compensation package for this position. Other compensation may include a bonus program or commission plan, and stock options if approved by 6sense’s board. In addition, 6sense provides a variety of benefits, including generous health insurance coverage, life, and disability insurance, a 401K employer matching program, paid holidays, self-care days, and paid time off (PTO).\nNotice of Collection and Use of Personal Information for California Residents:\nCalifornia Recruitment Privacy Notice and Policy\nOur Benefits:\nFull-time employees can take advantage of health coverage, paid parental leave, generous paid time-off and holidays, quarterly self-care days off, and stock options. We’ll make sure you have the equipment and support you need to work and connect with your teams, at home or in one of our oﬃces.\nWe have a growth mindset culture that is represented in all that we do, from onboarding through to numerous learning and development initiatives including access to our LinkedIn Learning platform. Employee well-being is also top of mind for us. We host quarterly wellness education sessions to encourage self care and personal growth. From wellness days to ERG-hosted events, we celebrate and energize all 6sense employees and their backgrounds.\nEqual Opportunity Employer:\n6sense is an Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. If you require reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please direct your inquiries to jobs@6sense.com.\nWe are aware of recruiting impersonation attempts that are not affiliated with 6sense in any way. All email communications from 6sense will originate from the @6sense.com domain. We will not initially contact you via text message and will never request payments. If you are uncertain whether you have been contacted by an official 6sense employee, reach out to jobs@6sense.com\n… more\nBenefits found in job post\n401(k), Medical insurance, Disability insurance",
    "url": "https://www.linkedin.com/jobs/view/4197395220/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=JERT3gAnTb%2BOaBEmCHVWYA%3D%3D&trk=flagship3_job_home_savedjobs"
  },
  {
    "description_text": "About the job\nPosition Summary\nTwo Sigma is a financial sciences company, combining data analysis, invention, and rigorous inquiry to help solve the toughest challenges in investment management, securities, private equity, and venture capital.\nOur team of scientists, technologists, and academics looks beyond the traditional to develop creative solutions to some of the world’s most complex economic problems.\nWe’re seeking an experienced Machine Learning/AI Engineer who is passionate about bridging innovative research with production-level deployment. In this role, you will work closely with researchers, data teams, and platform engineers to transform innovative ideas into scalable, efficient, and robust production systems. You’ll have the opportunity to develop and refine ML workflows and drive best practices across the entire ML lifecycle—from initial prototyping to inference and support.\nYou Will Take On The Following Responsibilities\nCollaborate with ML researchers to explore model architectures, training methodologies, and experimental objectives\nTranslate prototypes into reusable, maintainable, and production-ready code, ensuring research insights scale seamlessly into operation\nDesign, implement, and optimize fully automated training pipelines and evaluation workflows\nOptimize models for production—improving efficiency through techniques like quantization, distillation, and intelligent batching\nContinuously assess and fine-tune both research and production workflows, integrating user feedback and automated monitoring systems\nIdentify and implement opportunities for process improvements to reduce bottlenecks and improve overall modeler efficiency.\nStay ahead of industry trends and new technologies, incorporating sophisticated methodologies into production systems\nProvide technical guidance and mentorship to peers, ensuring the team uses new tools and techniques that drive innovation\nYou Should Possess The Following Qualifications\nBS in Computer Science, Mathematics, Physics, or related technical subject area\nMinimum 1 year of experience required; 7-15 years of experience preferred\nStrong software engineering skills using Python, version control, testing frameworks, and CI/CD practices\nAbility to work across functions and influence technical strategy while balancing research innovation with operational excellence\nA phenomenal teammate that can work efficiently with modeling and engineering partners\nExperience with leading ML frameworks (e.g., PyTorch, TensorFlow, HuggingFace) and familiarity with model serving/deployment tools, distributed systems and data infrastructures\nExperience with the following are preferred but not required:\nWorking with LLMs, multimodal models, or time-series forecasting\nML Ops platforms\nBackground in research or a proven understanding of ML theory\nYou Will Enjoy The Following Benefits\nCore Benefits: Fully paid medical and dental insurance premiums for employees and dependents, competitive 401k match, employer-paid life & disability insurance\nPerks: Onsite gyms with laundry service, wellness activities, casual dress, snacks, game rooms\nLearning: Tuition reimbursement, conference and training sponsorship\nTime Off: Generous vacation and unlimited sick days, competitive paid caregiver leaves\nHybrid Work Policy: Flexible in-office days with budget for home office setup\nThe base pay for this role will be between $165,000 and $300,000. This role may also be eligible for other forms of compensation and benefits, such as a discretionary bonus, health, dental and other wellness plans and 401(k) contributions. Discretionary bonus can be a significant portion of total compensation. Actual compensation for successful candidates will be carefully determined based on a number of factors, including their skills, qualifications and experience.\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics.\nTwo Sigma is committed to providing reasonable accommodations to qualified individuals in accordance with applicable federal, state, and local laws.\nIf you believe you need an accommodation, please visit our\nwebsite\nfor additional information.\n… more\nBenefits found in job post\n401(k), Dental insurance, Disability insurance",
    "url": "https://www.linkedin.com/jobs/view/4210015264/?refId=7413cc80-4917-4ac4-a71c-5ab4c465f688&trackingId=xTJtmQPYS5GIlilq7bZzYg%3D%3D&trk=flagship3_job_home_savedjobs"
  }
]